#### `terraform plan` Success
<details><summary>Show Output</summary>

```
CCESS_KEY_ID"
                          + value = "${AWS_ACCESS_KEY_ID}"
                        },
                    ]
                  + essential        = true
                  + image            = "jefferson22alcantara/challenge-job:worker2"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group  = "/ecs/frontend-container"
                          + awslogs-region = "us-east-1"
                        }
                    }
                  + memory           = 256
                  + name             = "worker2"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "AWS_ACCESS_KEY_ID"     = "AKIARNGY2NB3UYHGEWPA"
          + "AWS_SECRET_ACCESS_KEY" = "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"
          + "MONGO_DB_HOST"         = (known after apply)
          + "POSTGRESS_DB_HOST"     = (known after apply)
        }
    }

  # data.template_file.worker3 will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "worker3"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "MONGO_DB_HOST"
                          + value = "${MONGO_DB_HOST}"
                        },
                      + {
                          + name  = "POSTGRESS_DB_HOST"
                          + value = "${POSTGRESS_DB_HOST}"
                        },
                      + {
                          + name  = "AWS_SECRET_ACCESS_KEY"
                          + value = "${AWS_SECRET_ACCESS_KEY}"
                        },
                      + {
                          + name  = "AWS_ACCESS_KEY_ID"
                          + value = "${AWS_ACCESS_KEY_ID}"
                        },
                    ]
                  + essential        = true
                  + image            = "jefferson22alcantara/challenge-job:worker3"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group  = "/ecs/frontend-container"
                          + awslogs-region = "us-east-1"
                        }
                    }
                  + memory           = 256
                  + name             = "worker3"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "AWS_ACCESS_KEY_ID"     = "AKIARNGY2NB3UYHGEWPA"
          + "AWS_SECRET_ACCESS_KEY" = "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"
          + "MONGO_DB_HOST"         = (known after apply)
          + "POSTGRESS_DB_HOST"     = (known after apply)
        }
    }

  # aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 4
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = "challenge_ecs"
      + max_size                  = 5
      + metrics_granularity       = "1Minute"
      + min_size                  = 4
      + name                      = "challenge-asg"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"
    }

  # aws_autoscaling_group.asg-db will be created
  + resource "aws_autoscaling_group" "asg-db" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 60
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = "challenge_ecs_db"
      + load_balancers            = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "challenge-asg-db"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"
    }

  # aws_cloudwatch_log_group.log_group will be created
  + resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/frontend-container"
      + retention_in_days = 0
      + tags              = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
    }

  # aws_ecs_capacity_provider.test will be created
  + resource "aws_ecs_capacity_provider" "test" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "capacity-provider-test"

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = "ENABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = (known after apply)
              + minimum_scaling_step_size = (known after apply)
              + status                    = "ENABLED"
              + target_capacity           = 85
            }
        }
    }

  # aws_ecs_cluster.web-cluster will be created
  + resource "aws_ecs_cluster" "web-cluster" {
      + arn                = (known after apply)
      + capacity_providers = [
          + "capacity-provider-test",
        ]
      + id                 = (known after apply)
      + name               = "aws-app-bucket-sync"
      + tags               = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "web-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "challenge-web-app"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

  # aws_ecs_service.service-worker-1 will be created
  + resource "aws_ecs_service" "service-worker-1" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "service-worker-1"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

  # aws_ecs_service.service-worker-2 will be created
  + resource "aws_ecs_service" "service-worker-2" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "service-worker-2"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

  # aws_ecs_service.service-worker-3 will be created
  + resource "aws_ecs_service" "service-worker-3" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "service-worker-3"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + ordered_placement_strategy {
          + field = "cpu"
          + type  = "binpack"
        }
    }

  # aws_ecs_task_definition.task-definition-test will be created
  + resource "aws_ecs_task_definition" "task-definition-test" {
      + arn                   = (known after apply)
      + container_definitions = (known after apply)
      + family                = "web"
      + id                    = (known after apply)
      + network_mode          = "bridge"
      + revision              = (known after apply)
      + tags                  = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
    }

  # aws_ecs_task_definition.worker1 will be created
  + resource "aws_ecs_task_definition" "worker1" {
      + arn                   = (known after apply)
      + container_definitions = (known after apply)
      + family                = "worker1"
      + id                    = (known after apply)
      + network_mode          = "bridge"
      + revision              = (known after apply)
      + tags                  = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
    }

  # aws_ecs_task_definition.worker2 will be created
  + resource "aws_ecs_task_definition" "worker2" {
      + arn                   = (known after apply)
      + container_definitions = (known after apply)
      + family                = "worker2"
      + id                    = (known after apply)
      + network_mode          = "bridge"
      + revision              = (known after apply)
      + tags                  = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
    }

  # aws_ecs_task_definition.worker3 will be created
  + resource "aws_ecs_task_definition" "worker3" {
      + arn                   = (known after apply)
      + container_definitions = (known after apply)
      + family                = "worker3"
      + id                    = (known after apply)
      + network_mode          = "bridge"
      + revision              = (known after apply)
      + tags                  = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
    }

  # aws_iam_instance_profile.ecs_service_role will be created
  + resource "aws_iam_instance_profile" "ecs_service_role" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + role        = "ecs-instance-role-test-web"
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.ecs_service_role_db will be created
  + resource "aws_iam_instance_profile" "ecs_service_role_db" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + role        = "ecs-instance-role-db"
      + unique_id   = (known after apply)
    }

  # aws_iam_policy_attachment.ecs-instance-police-attachment-ec2-db will be created
  + resource "aws_iam_policy_attachment" "ecs-instance-police-attachment-ec2-db" {
      + id         = (known after apply)
      + name       = "ecs-instance-police-attachment-ec2-db"
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"
      + roles      = [
          + "ecs-instance-role-db",
        ]
    }

  # aws_iam_role.ecs-instance-role will be created
  + resource "aws_iam_role" "ecs-instance-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-instance-role-test-web"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs-instance-role-db will be created
  + resource "aws_iam_role" "ecs-instance-role-db" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "iam.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-instance-role-db"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_autoscale_role will be created
  + resource "aws_iam_role" "ecs_autoscale_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "application-autoscaling.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "_ecs_autoscale_role"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_execution_role will be created
  + resource "aws_iam_role" "ecs_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_task_execution_role"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_role will be created
  + resource "aws_iam_role" "ecs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_role"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.ecs_autoscale_role_policy will be created
  + resource "aws_iam_role_policy" "ecs_autoscale_role_policy" {
      + id     = (known after apply)
      + name   = "ecs_autoscale_role_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:DescribeServices",
                          + "ecs:UpdateService",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:DescribeAlarms",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.ecs_execution_role_policy will be created
  + resource "aws_iam_role_policy" "ecs_execution_role_policy" {
      + id     = (known after apply)
      + name   = "ecs_execution_role_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy.ecs_service_role_policy will be created
  + resource "aws_iam_role_policy" "ecs_service_role_policy" {
      + id     = (known after apply)
      + name   = "ecs_service_role_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                          + "elasticloadbalancing:Describe*",
                          + "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                          + "ec2:Describe*",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs-instance-role-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-instance-role-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "ecs-instance-role-test-web"
    }

  # aws_launch_configuration.lc will be created
  + resource "aws_launch_configuration" "lc" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-0aad1231da126e455"
      + instance_type               = "t2.micro"
      + key_name                    = "aws-app-bucket-sync"
      + name                        = "challenge_ecs"
      + security_groups             = (known after apply)
      + user_data                   = "9aafd608984ac5b7af3fae542fb789c3d1d6f755"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_launch_configuration.lc-db will be created
  + resource "aws_launch_configuration" "lc-db" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-0aad1231da126e455"
      + instance_type               = "t2.micro"
      + key_name                    = "aws-app-bucket-sync"
      + name                        = "challenge_ecs_db"
      + security_groups             = (known after apply)
      + user_data                   = "048e25fbc72d94d1d0f4cbed4278252fd7912331"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb.challenge-lb will be created
  + resource "aws_lb" "challenge-lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "challenge-ecs-lb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.web-listener will be created
  + resource "aws_lb_listener" "web-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.lb_target_group will be created
  + resource "aws_lb_target_group" "lb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "challenge-web-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 300
          + matcher             = "200,301,302"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 60
          + unhealthy_threshold = 10
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_security_group.ec2-sg will be created
  + resource "aws_security_group" "ec2-sg" {
      + arn                    = (known after apply)
      + description            = "allow all"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "allow-all-ec2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "jefferson.moura"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ec2-sg-db will be created
  + resource "aws_security_group" "ec2-sg-db" {
      + arn                    = (known after apply)
      + description            = "allow all"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "allow-all-ec2-db"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "jefferson.moura"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "allow-all-lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"      = "challenge_ecs_provisioning"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"      = "challenge_ecs_provisioning-public"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"      = "challenge_ecs_provisioning-public-us-east-1a"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + tags_all                        = {
          + "Name"      = "challenge_ecs_provisioning-public-us-east-1a"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"      = "challenge_ecs_provisioning-public-us-east-1b"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + tags_all                        = {
          + "Name"      = "challenge_ecs_provisioning-public-us-east-1b"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"      = "challenge_ecs_provisioning-public-us-east-1c"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + tags_all                        = {
          + "Name"      = "challenge_ecs_provisioning-public-us-east-1c"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"      = "challenge_ecs_provisioning"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + tags_all                         = {
          + "Name"      = "challenge_ecs_provisioning"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
    }

  # module.elb.module.elb.aws_elb.this[0] will be created
  + resource "aws_elb" "this" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = false
      + name                        = "db-elb"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = {
          + "Name"      = "db-elb"
          + "createdBy" = "jefferson.moura"
          + "env"       = "dev"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "TCP:5432"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 27017
          + instance_protocol = "TCP"
          + lb_port           = 27017
          + lb_protocol       = "TCP"
        }
      + listener {
          + instance_port     = 5432
          + instance_protocol = "TCP"
          + lb_port           = 5432
          + lb_protocol       = "TCP"
        }
    }

Plan: 44 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on ecs.tf line 100, in resource "aws_ecs_task_definition" "worker1":
 100:   container_definitions = "${data.template_file.worker1.rendered}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 8 more similar warnings elsewhere)

```

</details>

*Workflow: `Terraform`, Action: `hashicorpterraform-github-actions4`, Working Directory: `terraform`, Workspace: `default`*
